[
    {
        "id": "0",
        "name": "Sloan",
        "meaning": "Free man; valiant. Carlos is a masculine name with Spanish and English origins. A variant of the name Charles, this name means “free man” or “valiant.”"
    },
    {
        "id": "1",
        "name": "Asher",
        "meaning": "Asher is a Hebrew name meaning 'happy' and 'blessed.' It's derived from the Hebrew word osher, meaning 'happiness.'"
    },
    {
        "id": "2",
        "name": "Noah",
        "meaning": "The name Noah is primarily a male name of Hebrew origin that means Rest, Peace.In the Bible, Noah was known for gathering animals “two by two” and creating an ark of refuge for the great flood. Common nicknames include “No” and “Noey.”"
    },
    {
        "id": "3",
        "name": "Vincenzo",
        "meaning": "Vincenzo is an Italian male given name, derived from the Latin name Vincentius (the verb vincere means to win or to conquer)."
    },
    {
        "id": "4",
        "name": "Gustavo",
        "meaning": "Gustavo is a Spanish, Italian and Portuguese male given name. It has been a common name for Swedish monarchs since the reign of Gustav Vasa.is derived from Gustav /ˈɡʊstɑːv/, also spelled Gustaf, of Old Swedish origin, possibly meaning 'staff of the Geats', derived from the Old Norse elements Gautr (Geat) and stafr (staff). Another etymology speculates that the name may have a Slavic origin, through Swedish, from 'Gostislav', a compound word from Old Slavic 'Gost' (guest) and slava' (glory)."
    },
    {
        "id": "5",
        "name": "Trevor",
        "meaning": "The name Trevor is primarily a male name of English origin that means From The Big Village.An English derivation of the Welsh surname, Trefor, from the Welsh word elements 'tref' meaning village and 'mawr' meaning big."
    },
    {
        "id": "6",
        "name": "Ravi",
        "meaning": "Ravi is a masculine name of Sanskrit origin. With a definition like 'sun', baby will walk into every room knowing they light it up."
    },
    {
        "id": "7",
        "name": "Maxwell",
        "meaning": "The name Maxwell is of Scottish origin and means 'great stream.' It was originally a Scottish surname meaning Mack's stream, from the name Mack, a short form of the Scandinavian name Magnus, combined with Old English wella 'stream'."
    },
    {
        "id": "8",
        "name": "Oscar",
        "meaning": "The name is derived from two elements in Irish: the first, os, means 'deer'; the second element, car, means 'loving' or 'friend', thus 'deer-loving one' or 'friend of deer'."
    },
    {
        "id": "9",
        "name": "Jonas",
        "meaning": "The name Jonas is boy's name of Greek origin meaning 'dove'.Jonas has a slightly more grandfatherly image than the English version of his name, but that only adds to its retro appeal. And though it may lag behind Jonah in the US, Jonas is riding a huge wave of popularity in Europe, where it ranks highly in Germany, Switzerland, Austria and Norway."
    },
    {
        "id": "10",
        "name": "Curtis",
        "meaning": "Curtis or Curtiss is a common English given name and surname of Anglo-Norman origin from the Old French curteis (Modern French courtois) which ultimately derived from the Spanish Cortés (of which Cortez is a variation) and the Portuguese and Galician Cardoso. The name means polite, courteous, or well-bred."
    },
    {
        "id": "11",
        "name": "Magnus",
        "meaning": "Magnus is a Latin name, literally meaning “greatest,” that has a Scandinavian feel. It dates back to Charlemagne being called Carolus Magnus, or Charles the Great."
    },
    {
        "id": "12",
        "name": "Bruno",
        "meaning": "Bruno is a male given name. It is derived from the Old High German name Brun meaning Brown (modern Standard German: braun). Bruno."
    }
]