[
    {

        "id": "13",
        "name": "Emma",
        "meaning": "Emma is an English name with roots in an old Germanic word meaning “whole” or “universal.” A perfect fit for the baby who will be your whole world!"
    },
    {

        "id": "14",
        "name": "Mia",
        "meaning": "Mia means 'Ocean Goddess' or 'Queen'; it can also mean 'guardian of justice'. It is derived from many names, most commonly from the name Maria, but is also derived from names like Amelia (and its various spellings), and Maya"
    },
    {

        "id": "15",
        "name": "Charlotte",
        "meaning": "The name Charlotte is girl's name of French origin meaning 'free man'.Charlotte is the feminine form of the male given name Charles. It derived from Charlot, a French diminutive of Charles meaning 'little Charles', and the name of Charlemagne’s son in French literature and legend."
    },
    {

        "id": "16",
        "name": "Elizabeth",
        "meaning": "The name Elizabeth has religious roots and origins in Hebrew. Elizabeth can have several meanings including 'My God is an oath', 'My God is abundance', and 'edged to God'."
    },
    {

       
        "id": "17",
        "name": "Abigail",
        "meaning": "Abigail means 'cause of joy' or 'father's joy' in Hebrew. In the Bible, Abigail is described as a beautiful and intelligent woman."
    },
    {

        "id": "18",
        "name": "Marcy",
        "meaning": "The name Marcy is girl's name of Latin origin meaning 'Mars, god of war.'"
    },
    {

        "id": "19",
        "name": "Alessia",
        "meaning": "Alessia is an Italian given name, the feminine form of the male given name Alessio, the Italian form of Alexius. It is a popular name for females in Italy and was the second most popular name for Italian girls born in 2006"
    },
    {
        "id": "20",
        "name": "Thalita",
        "meaning": "The name Talitha is girl's name of Arabic, Aramaic origin meaning 'little girl'."
    },
    {
        "id": "21",
        "name": "Aurora",
        "meaning": "Aurora is a mystical and romantic name that means 'dawn' in Latin. An aurora also refers to a natural light display in the Earth's sky called the aurora polaris, or polar lights, visible only in high-latitude regions like the North and South Poles."
    },
    {
        "id": "22",
        "name": "Tamara",
        "meaning": "The name Tamara is primarily a female name of Russian origin that means Palm Tree."
    },
    {
        "id": "23",
        "name": "Brisa",
        "meaning": "(Spanish origin) meaning “breeze”."
    },
    {
        "id": "11",
        "name": "Cecilia",
        "meaning": "The name Cecilia is of Latin origin and means 'blind'. It is the feminine form of Cecil, which was derived from a Roman clan name related to the Latin caecus, also meaning 'blind.'"
    },
    {
        "id": "12",
        "name": "Bonnie",
        "meaning": "Bonnie is a Scottish given name and is sometimes used as a descriptive reference, as in the Scottish folk song, My Bonnie Lies over the Ocean. It comes from the Scots language word 'bonnie' (pretty, attractive), or the French bonne (good). That is in turn derived from the Latin word 'bonus' (good)."
    },
    {
        "id": "13",
        "name": "Henrietta",
        "meaning": "Meaning:home ruler. Henrietta as a girl's name is of Old German origin meaning 'home ruler'. It is the feminine form of Henry and a more formal version of Harriet."
    },
    {
        "id": "14",
        "name": "Olivia",
        "meaning": "Oliva is a Spanish, Portuguese, Italian, and Czech surname meaning 'olive'."
    },
    {
        "id": "15",
        "name": "Jennifer",
        "meaning": "History. 'Jennifer' may mean 'the fair one' (from Proto-Celtic “Windo-seibrā”). A Cornish form, it is cognate with the Welsh form Gwenhwyfar and with the Old Irish Findabair."
    },
    {
        "id": "16",
        "name": "Irina",
        "meaning": "Irina (Cyrillic: Ирина) is a feminine given name of Ancient Greek origin, commonly borne by followers of the Eastern Orthodox Church. It is derived from Eirene (Ancient Greek: Εἰρήνη), an ancient Greek goddess, personification of peace."
    },
    {
        "id": "17",
        "name": "Laura",
        "meaning": "The name Laura is the feminized form of laurus, Latin for 'bay laurel plant', which in the Greco-Roman era was used as a symbol of victory, honor or fame. The name represents the embodiment of victory and strength."
    },
    {
        "id": "18",
        "name": "Tonya",
        "meaning": "Latin : Praiseworthy; Feminine form of Anthony. African American : Praised woman. English : Fairy queen. Latin : Worthy of praise."
    },
    {
        "id": "19",
        "name": "Sandra",
        "meaning": "Sandra is a female name, which is often used as a short form for Alexandra or Cassandra. Alexandra is a feminine form of the male name Alexander, which is a romanization of the Greek name Ἀλέξανδρος Alexandros. It is generally interpreted to mean 'protector of man' or 'defender of man'."
    },
    {
        "id": "20",
        "name": "Rashmi",
        "meaning": "Rashmi (also Rashami, Rashmika) (Sanskrit: रश्मि) is a Hindu, Sanskrit unisexual name in India. Rashmi means a single 'ray of light', a very popular name in Hindu. More common in females as compared to males."
    },
    {
        "id": "21",
        "name": "Patricia",
        "meaning": "Patricia is a common female given name of Latin origin. Derived from the Latin word patrician, meaning 'noble', it is the feminine form of the masculine given name Patrick."
    },
    {
        "id": "22",
        "name": "Brenda",
        "meaning":  "Brenda is a female given name: from a Germanic word meaning “flame” or “sword.”"

    }
]