[
    {
        "id": "0",
        "name": "Sloan",
        "meaning": "raider; warrior. Sloan is a gender-neutral baby name of Irish origin. Anglicized form of the Irish surname Ó Sluaghadháin, Sloan directly translates to “raider” or “warrior.” A variant of the names Sloane and Slowan, Sloan is often associated with tall tales and brave leaders.”"
    },
    {
        "id": "1",
        "name": "Blake",
        "meaning": "Blake is a given name which originated from Old English. Its derivation is uncertain; it could come from 'blac', a nickname for someone who had dark hair or skin, or from 'blaac', a nickname for someone with pale hair or skin.'"
    },
    {
        "id": "2",
        "name": "Taylor",
        "meaning": "The name Taylor is of Old English origin and means 'tailor.' It was originally an occupational surname. It is from the Norman French word tailleur, which is from the Latin taliare, meaning 'to cut.'"
    },
    {
        "id": "3",
        "name": "Parker",
        "meaning": "The name Parker is of Old English origin and means 'cultivated land.' It derives from the English surname that was for people 'keepers of the park'."
    },
    {
        "id": "4",
        "name": "Spencer",
        "meaning": "Spencer is a given name of British origin, that means 'steward' or 'administrator'."
    },
    {
        "id": "5",
        "name": "Ryan",
        "meaning": "The name Ryan is primarily a gender-neutral name of Irish origin that means Descendant Of The King."
    },
    {
        "id": "6",
        "name": "Reed",
        "meaning": "Reed is a gender-neutral name of British origin, coming from the Old English word read, meaning “red.” Reed was originally a surname often used to describe someone with red hair."
    },
    {
        "id": "7",
        "name": "Amory",
        "meaning": "Amory is a gender-neutral name of English and German origins, meaning “home strength” and “home-ruler.” This sweet-sounding name is also said to derive from the French “Amauri,” meaning “work ruler” or “diligent ruler.”"
    },
    {
        "id": "8",
        "name": "Cameron",
        "meaning": "The name Cameron is of English and Scottish origin and means 'bent nose.' It is believed that this meaning originated from a nickname given to an early member of the clan. It derives from the Gaelic cam 'crooked' and sròn 'nose'."
    },
    {
        "id": "9",
        "name": "Sutton",
        "meaning": "The name Sutton is both a boy's name and a girl's name of English origin meaning 'from the southern homestead'."
    },
    {
        "id": "10",
        "name": "Emerson",
        "meaning": "Emerson is a gender-neutral name with German origins. Meaning “brave,” “powerful,” and “child of Emery,” this name has a strong definition to be proud of. Emerson is a quirky combination of the more common names Emma and Emily. In the past, Emerson was used more for baby girls but the tide has changed in recent years. "
    },
    {
        "id": "11",
        "name": "Austin",
        "meaning": "The name Austin is of English origin and means great, magnificent' It's the medieval contracted form of Augustine."
    },
    {
        "id": "12",
        "name": "Ezra",
        "meaning": " Ezra comes from the Hebrew word azar meaning “help,” “aid,” or “protect.” The original long form of the name may have been Azaryahu, meaning “God helps” or “God protects.”"
    },
    {
        "id": "13",
        "name": "Logan",
        "meaning": "Logan is a Scottish name that comes from the Gaelic word “lagan” or “lag,” which means “hollow” (although the name itself means “little hollow”). It was originally a surname in Scotland but eventually began to be used as a first name as well."
    },
    
    {
        "id": "14",
        "name": "Riley",
        "meaning": "The name Riley is of Irish and Gaelic origin meaning “valiant” and “rye meadow” "
    },
    {
        "id": "15",
        "name": "Skylar/Skyler",
        "meaning": "Skylar is a gender-neutral name of Dutch origin. A variant of the surname Schuyler, it means 'scholar' and was introduced to the United States in the 17th century by Dutch settlers. While Skylar is commonly used for girls, the alternative spelling Skyler is more popular for boys."
    },
    {
        "id": "16",
        "name": "Brett",
        "meaning": "Brett derives from a Middle English surname meaning 'Briton' or 'Breton', referring to the Celtic people of Britain and Brittany, France."
    },
    {
        "id": "17",
        "name": "Sage",
        "meaning": "Sage is a family name and a unisex given name. It can also be spelled Saige, Sange or Sayge. Its meaning is 'herb' or 'prophet'."
    },
    {
        "id": "18",
        "name": "Sawyer",
        "meaning": "Sawyer is a gender-neutral occupational name of English origins, meaning “woodcutter.” The name originally found fame in Mark Twain's Adventures of Tom Sawyer, as an ever-mischievous and adventurous little boy. "
    },
    {
        "id": "19",
        "name": "Rowan",
        "meaning": "What Does Rowan Mean? Rowan is a historically masculine name of Irish and English origins. In Ireland, it's derived from the Irish name Ruadhán, which means “red-haired.” Its English origins also can be traced to the Irish given name."
    },
    {
        "id": "20",
        "name": "Morgan",
        "meaning": "The name Morgan means 'sea-born', 'sea-song',  or 'sea-circle.' It is traditionally a boy's name of Welsh origin, and more specifically, a variant of the Old Welsh name Morcant which is a combination of the Welsh elements mor, meaning 'sea' and cant, meaning 'circle.'"
    },
    {
        "id": "21",
        "name": "Quinn",
        "meaning": "Irish, Celtic, Gaelic, Latin. Gender: Quinn is considered a gender-neutral name, traditionally meaning 'head' and 'wise'."
    },
    {
        "id": "22",
        "name": "Finley",
        "meaning": "With Irish origins, Finley is a gender-neutral name meaning “fair-haired courageous one.” With such an amazing definition it's no wonder that both boys and girls are called Finley! Traditionally, Finley was considered a boys name."
    }
]
